Catalogs/OrderParameters.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>OrderParameters</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DataType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VisibleInMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditableInMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ValueList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/DataType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>DataType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>String</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Integer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Decimal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Boolean</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DateTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ValueList</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Snapshot</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/OrderParameters/Forms/ItemForm/Ext/Form/Module.bsl
&AtServer
Function NotAllowed()
	
	If Object.DataType=Enums.DataType.ValueList AND Object.ValueList.Count()=0 Then
		
		Message(NStr("en=""Tabular section couldn't be empty!"";ru='Табличная часть не может быть пустой!';cz='Tabulkovб sekce nesmн bэt prбzdnб!'"));
		Return True;
		
	EndIf;
	
	Return False;
	
EndFunction

&AtServer
Function  DataTypeOnChangeServer()
	
	Return Object.DataType = Enums.DataType.ValueList;
	
EndFunction

&AtServer
Procedure OnOpenAtServer()
	
	Items.Code.ReadOnly 	= 	Not Users.HaveAdditionalRight(Catalogs.AdditionalAccessRights.EditCatalogNumbers);
	
EndProcedure


&AtClient
Procedure OnOpen(Cancel)
	
	OnOpenAtServer();
	
	Items.ValueList.Visible = NOT Object.ValueList.Count() = 0;
	Items.EditableInMA.ReadOnly = Not Object.VisibleInMA;
	
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	
	If NotAllowed() Then
		
		Cancel=True;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure DataTypeOnChange(Item)
	
	If DataTypeOnChangeServer() Then
		
		Items.ValueList.Visible = True;
		
	Else
		
		If Object.ValueList.Count() <> 0 Then
			
			Text = "en = ""The tabular section will be cleaned. 
			|Are you sure you want to continue?"";
			|ru = ""Табличная часть будет очищена.
			|Продолжить?""";
			OpenForm("CommonForm.DoQueryBox", New Structure("Text, Source", NStr(Text), "ClearParameters"));
			
		Else
			
			Items.ValueList.Visible = False;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure VisibleInMAOnChange(Item)
	
	If  NOT Object.VisibleInMA Then
		
		Object.EditableInMA = False;
		
	EndIf;
	
	Items.EditableInMA.ReadOnly = Not Object.VisibleInMA;
	
EndProcedure
